# DimensionSegment Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionSegment Class
Members See Also
---
A segment of a dimension within the Autodesk Revit project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class DimensionSegment : APIObject
```

Visual Basic
---
```text
Public Class DimensionSegment _
	Inherits APIObject
```

Visual C++
---
```text
public ref class DimensionSegment : public APIObject
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..DimensionSegment
# See Also
DimensionSegment Members
Autodesk.Revit.DB Namespace